---
onenote-id: 0-d637b93194cb0e6c3170c95d50985652!1-DBD29CD2C5C95FE5!s5aaff8ddddca4cce89d68fbf9ed2883a
---
# 常见算法

## 基本查找

核心：从0索引开始往后查找

|   |   |
|---|---|
|1  <br>2  <br>3  <br>4  <br>5  <br>6  <br>7  <br>8|**public static boolean** basicSearch**(****int****[]** arr**,** **int** number**) {**  <br>**for** **(****int** i **=** **0****;** i **\<** arr**.**length**;** i**++) {**  <br>**if** **(**arr**[**i**] ==** number**) {**  <br>**return** **true****;**  <br>**}**  <br>**}**  <br>**return** **false****;**  <br>**}**|

## 二分查找/折半查找

**前提条件：**数组中的数据必须是有序的。  
如果数据是乱的，先排序再用二分查找得到的索引没有实际意义，只能确定当前数字在数组中是否存在，因为排序之后数字的位置就可能发生变化。  
**核心逻辑：**每次排除一半的查找范围。

1. min和max表示当前要查找的范围。
2. mid是在min和max中间的。
3. 如果要查找的元素在mid的左边，缩小范围时，min不变，max等于mid - 1。
4. 如果要查找的元素在mid的右边，缩小范围时，max不变，min等于mid + 1。

|   |   |
|---|---|
|1  <br>2  <br>3  <br>4  <br>5  <br>6  <br>7  <br>8  <br>9  <br>10  <br>11  <br>12  <br>13  <br>14  <br>15  <br>16  <br>17|**public static int** binarySearch**(****int****[]** arr**,** **int** number**) {**  <br>**int** min **=** **0****;**  <br>**int** max **=** arr**.**length **-** **1****;**  <br>**while** **(****true****) {**  <br>**if** **(**min **\>** max**) {**  <br>**return** **-****1****;**  <br>**}**  <br>**int** mid **= (**min **+** max**) /** **2****;**  <br>**if** **(**arr**[**mid**] \>** number**)) {**  <br>max **=** mid **-** **1****;**  <br>**}** **else if** **(**arr**[**mid**] \<** number**) {**  <br>min **=** mid **+** **1****;**  <br>**}** **else** **{**  <br>**return** mid**;**  <br>**}**  <br>**}**  <br>**}**|

## 插值查找

mid尽可能的靠近要查找的数据，但是要求数据尽可能的分布均匀。  
**斐波那契查找**  
根据黄金分割点来计算mid指向的位置。
 
## 分块查找

**分块的原则****1****：**前一块中的最大数据，小于后一块中所有数据（块内无序，块间有序）。  
**分块的原则****2****：**块数熟练一般等于数字的个数开根号。比如：16个数字一般分为4块左右。  
**核心思路：**先确定要查找的元素在哪一块，然后在块内挨个查找。  
**块对象组成的数组称为索引表。**

|                                                                                                                                                                                                                                                                                                   |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |
| ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ |
| 1  <br>2  <br>3  <br>4  <br>5  <br>6  <br>7  <br>8  <br>9  <br>10  <br>11  <br>12  <br>13  <br>14  <br>15  <br>16  <br>17  <br>18  <br>19  <br>20  <br>21  <br>22  <br>23  <br>24  <br>25  <br>26  <br>27  <br>28  <br>29  <br>30  <br>31  <br>32  <br>33  <br>34  <br>35  <br>36  <br>37  <br>38 | **class** Block**{**  <br>**private int** max**;**  <br>**private int** startIndex**;**  <br>**private int** endIndex**;**  <br>**public** Block**() {}**  <br>javabean **class** standard**;**  <br>**}**<br><br>  <br><br>Block b1 **=** **new** Block**(****21****,** **0****,** **5****);**  <br>Block b2 **=** **new** Block**(****45****,** **6****,** **11****);**  <br>Block b3 **=** **new** Block**(****73****,** **12****,** **17****);**  <br>Block**[]** blockArr **=** **new** Block**[] {**b1**,** b2**,** b3**};**  <br>**int** number **=** **30****;**  <br>**int** index **=** getIndex**(**blockArr**,** arr**,** number**);**<br><br>  <br><br>**private static void** getIndex**(**Block**[]** blockArr**,** **int** arr**,** **int** number**) {**  <br>**int** indexBlock **=** findIndexBlock**(**blockArr**,** number**);**  <br>**if** **(**indexBlock **== -****1****) {**  <br>**return** **-****1****;**  <br>**}**  <br>**int** startIndex **=** blockArr**[**indexBlock**].**getStartIndex**();**  <br>**int** endIndex **=** blockArr**[**indexBlock**].**getEndIndex**();**  <br>**for** **(****int** i **=** startIndex**;** i **\<=** endIndex**;** i**++) {**  <br>**if** **(**arr**[**i**] ==** number**) {**  <br>**return** i**;**  <br>**}**  <br>**}**  <br>**return** **-****1****;**  <br>**}**<br><br>  <br><br>**private static int** findIndexBlock**(**Block**[]** blockArr**,** **int** number**) {**  <br>**for** **(****int** i **=** **0****;** i **\<** blockArr**.**length**;** i**++) {**  <br>**if** **(**number **\<=** blockArr**[**i**].**getMax**()) {**  <br>**return** i**;**  <br>**}**  <br>**}**  <br>**return** **-****1****;**  <br>**}** |

## 扩展的分块查找（无规律的数据）

## 扩展的分块查找（查找的过程中还需要添加数据）

## 哈希查找

## 树表查找
 
## 冒泡排序

相邻的数据两两比较，小的放前面，大的放后面。

1. 相邻的元素两两比较，大的放右边，小的放左边。
2. 第一轮循环结束，最大值已经找到，在数组的最右边。
3. 第二轮循环只要在剩余的元素找最大值就可以了。
4. 每二轮循环结束，次最大值已经确定，第三轮循环继续在剩余数据中循环。

注意：

1. 相邻的元素两两比较，大的放右边，小的放左边。
2. 第一轮比较完毕之后，最大值就已经确定，第二轮可以少循环一次，后面以此类推。
3. 如果数组中有n个数据，总共我们只要执行n - 1轮的代码就可以。

|   |   |
|---|---|
|1  <br>2  <br>3  <br>4  <br>5  <br>6  <br>7  <br>8  <br>9|**for** **(****int** i **=** **0****;** i **\<** arr**.**length **-** **1****;** i**++) {**  <br>**for** **(****int** j **=** **0****;** j **\<** arr**.**length **-** **1****;** j**++) {**  <br>**if** **(**arr**[**j**] \>** arr**[**j **+** **1****]) {**  <br>**int** temp **=** arr**[**j**];**  <br>arr**[**j**] =** arr**[**j **+** **1****];**  <br>arr**[**j **+** **1****] =** temp**;**  <br>**}**  <br>**}**  <br>**}**|

## 选择排序

从0索引开始，拿着每一个索引上的元素跟后面的元素依次比较，小的放前面，大的放后面，以此类推。

|   |   |
|---|---|
|1  <br>2  <br>3  <br>4  <br>5  <br>6  <br>7  <br>8  <br>9|**for** **(****int** i **=** **0****;** i **\<** arr**.**length **-** **1****;** i**++) {**  <br>**for** **(****int** j **=** i **+** **1****;** i **\<** arr**.**length**;** i**++) {**  <br>**if** **(**arr**[**i**] \>** arr**[**j**]) {**  <br>**int** temp **=** arr**[**i**];**  <br>arr**[**i**] =** arr**[**j**];**  <br>arr**[**j**] =** temp**;**  <br>**}**  <br>**}**  <br>**}**|
 
## 插入排序

将0索引的元素到N索引的元素看作是有序的，把N + 1索引的元素到最后一个当成是无序的。遍历无序的数据，将遍历到的元素插入有序序列中适当的位置，如遇到相同数据，插在后面。  
N的范围：0 - 最大索引。

|                                                                                                                           |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |
| ------------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| 1  <br>2  <br>3  <br>4  <br>5  <br>6  <br>7  <br>8  <br>9  <br>10  <br>11  <br>12  <br>13  <br>14  <br>15  <br>16  <br>17 | **int** startIndex **= -****1****;**  <br>**for** **(****int** i **=** **0****;** i **\<** arr**.**length**;** i**++) {**  <br>**if** **(**arr**[**i**] \>** arr**[**i **+** **1****]) {**  <br>startIndex **=** i **+** **1****;**  <br>**break****;**  <br>**}**  <br>**}**<br><br>  <br><br>**for** **(****int** i **=** startIndex**;** i **\<** arr**.**length**;** i**++) {**  <br>**int** j **=** i**;**  <br>**while** **(**j **\>** **0** **&&** arr**[**j**] \<** arr**[**j **-** **1****]) {**  <br>**int** temp **=** arr**[**j**];**  <br>arr**[**j**] =** arr**[**j **-** **1****];**  <br>arr**[**j **-** **1****] =** temp**;**  <br>j**--;**  <br>**}**  <br>**}** |

## 递归算法

递归指的是方法中调用方法本身的现象。  
**递归的注意点：**递归一定要有出口，否则就会出现内存溢出。  
**递归算法的作用**  
把一个复杂的问题层层转换为一个与原问题相似的规模较小的问题来求解。  
递归策略只需少量的程序就可描述出解题过程所需要的多次重复计算。  
**书写递归的两个核心：**

- 找出口：什么时候不再调用方法。
- 找规则：如何把大问题变成规模较小的问题。
 
## 快速排序

第一轮：把0索引的数字作为基准数，确定基准数在数组中正确的位置。比基准数小的全部在左边，比基准数大的全部在右边。

|   |   |
|---|---|
|1  <br>2  <br>3  <br>4  <br>5  <br>6  <br>7  <br>8  <br>9  <br>10  <br>11  <br>12  <br>13  <br>14  <br>15  <br>16  <br>17  <br>18  <br>19  <br>20  <br>21  <br>22  <br>23  <br>24  <br>25  <br>26  <br>27  <br>28  <br>29  <br>30  <br>31  <br>32  <br>33|**public static void** quickSort**(****int****[]** arr**,** **int** i**,** **int** j**) {**  <br>**int** start **=** i**;**  <br>**int** end **=** j**;**  <br>  <br>**if** **(**start **\>** end**) {**  <br>**return** **;**  <br>**}**  <br>  <br>**int** baseNumber **=** arr**[**i**];**  <br>**while** **(****true****) {**  <br>**while** **(****true****) {**  <br>**if** **(**end **\<=** start **\|** arr**[**end**] \<** baseNumber**) {**  <br>**break****;**  <br>**}**  <br>end**--;**  <br>**}**  <br>**while** **(****true****) {**  <br>**if** **(**end **\<=** start **\|** arr**[**start**] \>** baseNumber**) {**  <br>**break****;**  <br>**}**  <br>start**++;**  <br>**}**  <br>**int** temp **=** arr**[**start**];**  <br>arr**[**start**] =** arr**[**end**];**  <br>arr**[**end**] =** temp**;**  <br>**}**  <br>**int** temp **=**arr**[**i**];**  <br>arr**[**i**] =** arr**[**start**];**  <br>arr**[**start**] =** temp**;**  <br>  <br>quickSort**(**arr**,** i**,** start **-** **1****);**  <br>quickSort**(**arr**,** start **+** **1****,** j**);**  <br>**}**|
    
# Arrays

操作数组的工具类

|   |   |
|---|---|
|方法名|说明|
|public static String toString(数组)|把数组拼接成一个字符串|
|public static int binarySearch(数组， 查找的元素)|二分查找法查找元素|
|public static int[] copyOf(原数组， 新数组长度)|拷贝数组|
|public static int[] copyOfRange(原数组，起始索引，结束索引)|拷贝数组（指定范围）|
|public static void fill(数组， 元素)|填充数组|
|public static void sort(数组)|按照默认方式进行数组排序|
|public static void sort(数组, 排序规则)|按照指定的规则排序|

**注意**：在sort方法中，第二个参数是一个接口，所以在调用方法的时候，需要传递这个接口的实现类对象，作为排序的规则。但是这个实现类，我们只要使用一次，所以就没有必要单独的去写一个类，直接采取匿名内部类的方式就可以了。  
**底层原理**  
利用插入排序 + 二分查找的方式进行排序的。  
默认把0索引的数据当作是有序的序列，1索引到最后认为是无序的序列。  
遍历无序的序列得到里面的每一个元素，假设当前遍历得到的元素是A元素。  
把A往有序序列中进行插入，在插入的时候，是利用二分查找确定A元素的插入点。  
拿着A元素，跟插入点的元素进行比较，比较的规则就是compare方法的方法体。  
如果方法的返回值是负数，拿着A继续跟前面的数据进行比较。  
如果方法的返回值是整数，拿着A继续跟后面的数据进行比较。  
如果方法的返回值是0，也拿着A跟后面的数据进行比较。  
直到能确定A的最终位置为止。  
**compare****方法的形式参数：**  
参数一：表示在无序序列中，遍历得到的每一个元素。  
参数二：有序序列中的元素。  
**返回值：**  
负数：表示当前要插入的元素是小的，放在前面。  
正数：表示当前要插入的元素是大的，放在后面。  
0：表示当前要插入的元素跟现在的元素比是一样的，也会放在后面。
    
# Lambda表达式

## 函数式编程

函数式编程（Functional programming）是一种思想特点。  
面向对象：先找对象，让对象做事情。  
函数式编程思想，忽略面向对象的复杂语法，**强调做什么，而不是谁去做。**  
**Lambda****表达式的标准格式**  
Lambda表达式是JDK8开始后的一种新语法形式。  
**注意点：**

- Lambda表达式可以用来简化匿名内部类的书写。
- Lambda表达式只能简化函数式接口的匿名内部类的写法。
- 函数式接口：有且仅有一个抽象方法的接口叫做函数式接口，接口上方可以加@FunctionalInterface注解。

|   |   |
|---|---|
|1  <br>2  <br>3  <br>4  <br>5  <br>6  <br>7  <br>8  <br>9  <br>10  <br>11  <br>12  <br>13  <br>14|method**(**  <br>**() -\> {**  <br>System**.**out**.**println**(**"Swimming"**);**  <br>**}**  <br>**);**<br><br>  <br><br>**public static void** method**(**Swim s**) {**  <br>s**.**swimming**();**  <br>**}**<br><br>  <br><br>@FunctionalInterface  <br>**interface** Swim**{**  <br>**public abstract void** swimming**();**  <br>**}**|

## Lambda表达式的省略写法

Lambda的省略规则：

1. 参数类型可以省略不写。
2. 如果只有一个参数，参数类型可以省略，同时()也可以省略。
3. 如果Lambda表达式的方法体只有一行，大括号，分号，return可以省略不写，需要同时省略。